#ifndef __LISTENAI_TONE_PACKAGE_H__
#define __LISTENAI_TONE_PACKAGE_H__

enum {
TONE_ID_0 = 0,// 000_我是小度,快来跟我说话吧.mp3
TONE_ID_1 = 1,// 001_我先离开,有需要再叫我.mp3
TONE_ID_2 = 2,// 002_唤醒词已设置为小度小度.mp3
TONE_ID_3 = 3,// 003_唤醒词已设置为小爱同学.mp3
TONE_ID_4 = 4,// 004_唤醒词已设置为天猫精灵.mp3
TONE_ID_5 = 5,// 005_嗯.mp3
TONE_ID_6 = 6,// 006_来了.mp3
TONE_ID_7 = 7,// 007_请说.mp3
TONE_ID_8 = 8,// 008_干啥.mp3
TONE_ID_9 = 9,// 009_好的.mp3
TONE_ID_10 = 10,// 010_电风扇已打开.mp3
TONE_ID_11 = 11,// 011_电风扇已关闭.mp3
TONE_ID_12 = 12,// 012_好的,已开机.mp3
TONE_ID_13 = 13,// 013_好的,已关机.mp3
TONE_ID_14 = 14,// 014_播报已开启.mp3
TONE_ID_15 = 15,// 015_播报已关闭.mp3
TONE_ID_16 = 16,// 016_语音功能已开启.mp3
TONE_ID_17 = 17,// 017_语音功能已关闭.mp3
TONE_ID_18 = 18,// 018_我已开机,快来唤醒我.mp3
TONE_ID_19 = 19,// 019_已增大音量.mp3
TONE_ID_20 = 20,// 020_音量已调到最大.mp3
TONE_ID_21 = 21,// 021_已减小音量.mp3
TONE_ID_22 = 22,// 022_音量已调到最小.mp3
TONE_ID_23 = 23,// 023_音量已经是最大了.mp3
TONE_ID_24 = 24,// 024_音量已经是最小了.mp3
TONE_ID_25 = 25,// 025_主人我休息了有事再叫我.mp3
TONE_ID_26 = 26,// 026_请在安静环境下,按提示学习唤醒词,请说唤醒词的指令.mp3
TONE_ID_27 = 27,// 027_请在安静环境下,按提示学习命令词.mp3
TONE_ID_28 = 28,// 028_录入成功,请再说一次.mp3
TONE_ID_29 = 29,// 029_录入失败,请再说一次.mp3
TONE_ID_30 = 30,// 030_检测到语速过快或过慢,请使用正常语速录入.mp3
TONE_ID_31 = 31,// 031_检测到字数超出有效范围,请换种说法.mp3
TONE_ID_32 = 32,// 032_前后两次录入内容不一致,请再说一次.mp3
TONE_ID_33 = 33,// 033_检测到与默认指令冲突,请换种说法.mp3
TONE_ID_34 = 34,// 034_学习模板已达上限.mp3
TONE_ID_35 = 35,// 035_学习成功.mp3
TONE_ID_36 = 36,// 036_学习失败.mp3
TONE_ID_37 = 37,// 037_学习完成.mp3
TONE_ID_38 = 38,// 038_请说打开电风扇的相关指令.mp3
TONE_ID_39 = 39,// 039_请说关闭电风扇的相关指令.mp3
TONE_ID_40 = 40,// 040_当前已经是最后一条可学习命令词.mp3
TONE_ID_41 = 41,// 041_当前已经是第一条可学习命令词.mp3
TONE_ID_42 = 42,// 042_请再说一遍.mp3
TONE_ID_43 = 43,// 043_唤醒词删除成功.mp3
TONE_ID_44 = 44,// 044_命令词删除成功.mp3
TONE_ID_45 = 45,// 045_全部删除成功.mp3
TONE_ID_46 = 46,// 046_退出学习模式.mp3
TONE_ID_47 = 47,// 047_退出删除模式.mp3
TONE_ID_48 = 48,// 048_删除失败.mp3
TONE_ID_MAX
};

#endif
